#!/usr/bin/env python
# -*- coding: utf-8 -*-
# -------------------------------------------------------------------------------
# Расположение БД
PATH_DB_FOR_TOOLS = f"{__file__}".replace("obj\\constants.py", "data\\cutting_tools.db")
# Настройки начальных данных
DEFAULT_SETTINGS_FOR_CUTTING_TOOL = {
    "milling":        {"marking": '2214-0507', "Стандарт": "ГОСТ 16223-81", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "turning":        {"marking": '2100-0029', "Стандарт": "ГОСТ 18878-73", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "planing":        {"marking": '2180-0803', "Стандарт": "ГОСТ 10046-72", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "drilling":       {"marking": '2300-0041', "Стандарт": "ГОСТ 886-77", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "countersinking": {"marking": '2320-2125', "Стандарт": "ГОСТ 21584-76", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "deployment":     {"marking": '2364-0331', "Стандарт": "ГОСТ 883-80", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "broaching":      {"pitch_of_teeth": 0.5,           # шаг зубьев
                       "angle_of_inclination": 0,       # угол наклона зубьев
                       "number_teeth_section": 5,       # количество зубьев в секции
                       "type_cutter": 0,                # тип протяжки (шлицевая, круглая и пр.)
                       "difference": 0.1,               # размерный перепад между соседними зубьями
                       "length_of_working_part": 1000,  # длина режущей части протяжки
                       },
        }
HARD_ALLOYS = {"Т5К12В": 0, "Т5К10": 1, "Т14К8": 2, "Т15К6":  3, "Т30К4": 4, "ВК3": 5, "ВК4": 6, "ВК6": 7, "ВК8": 8}
HIGH_SPEED_STEELS = {"Р18": 9, "Р6М5": 10, "9ХС": 11, "ХГВ": 12, "У12А": 13}
# Словарь индексов материалов режущей части
MATERIALS_OF_CUTTING_PART = HARD_ALLOYS | HIGH_SPEED_STEELS

# Словарь наименований группы инструмента
GROUPS_TOOL = {"Инструмент": 0,
               "Резец": "turning",
               "Фреза": "milling",
               "Сверло": "drilling",
               "Зенкер": "countersinking",
               "Развертка": "deployment",
               "Протяжка": "broaching",
               }
# Типы стандартов инструмента
TYPES_STANDARD = ["ГОСТ", "ОСТ", "DIN", "ИСО"]

# Типы фрез:
TYPES_OF_MILLING_CUTTER = {"Цилиндрическая": 0,
                           "Торцовая": 1,
                           "Дисковая, обработка торца": 2,
                           "Дисковая, обработка паза": 3,
                           "Пазовая": 3,
                           "Отрезная": 4,
                           "Прорезная": 4,
                           "Концевая, обработка торца": 5,
                           "Концевая, обработка паза": 6,
                           "Угловая": 7,
                           "Фасонная, с выпуклым профилем": 8,
                           "Фасонная, с вогнутым профилем": 9,
                           "Шпоночная": 10,
                           "Резьбовая": 8,
                           "Червячная": 0,
                           }
# Типы режущей части фрезы:
TYPES_OF_CUTTING_PART_OF_MILLING_CUTTER = {"Винтовые пластинки": 0, "Цельная": 1, "Коронка": 2}
# Типы частоты шага:
TYPES_OF_LARGE_TOOTH = {"Крупный шаг": 0, "Мелкий шаг": 1}
# Типы частоты шага:
TYPES_OF_TOOL_HOLDER = {"В резцедержателе": 0, "В револьверной головке": 1}
# Типы нагрузок на резец
TYPES_OF_LOADS = {"Равномерная": 0, "Неравномерная": 1, "Неравномерная с большой неравномерностью": 2}

