#!/usr/bin/env python
# -*- coding: utf-8 -*-
# -------------------------------------------------------------------------------
# Расположение БД
PATH_DB_FOR_TOOLS = f"{__file__}".replace("obj\\constants.py", "data\\cutting_tools.db")
# =====================================================================================================================
# Настройки начальных данных
DEFAULT_SETTINGS_FOR_CUTTING_TOOL = {
    "milling":        {"marking": '2214-0507', "Стандарт": "ГОСТ 16223-81", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5", "tolerance": "h14"},
    "turning":        {"marking": '2100-0029', "Стандарт": "ГОСТ 18878-73", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "planing":        {"marking": '2180-0803', "Стандарт": "ГОСТ 10046-72", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5"},
    "drilling":       {"marking": '2300-0041', "Стандарт": "ГОСТ 886-77", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5", "tolerance": "H14"},
    "countersinking": {"marking": '2320-2125', "Стандарт": "ГОСТ 21584-76", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5", "tolerance": "H10"},
    "deployment":     {"marking": '2364-0331', "Стандарт": "ГОСТ 883-80", "quantity": 1, "type_of_mat": 0,
                       "mat_of_cutting_part": "Р6М5", "tolerance": "H8"},
    "broaching":      {"pitch_of_teeth": 0.5,           # шаг зубьев
                       "angle_of_inclination": 0,       # угол наклона зубьев
                       "number_teeth_section": 5,       # количество зубьев в секции
                       "type_cutter": 0,                # тип протяжки (шлицевая, круглая и пр.)
                       "difference": 0.1,               # размерный перепад между соседними зубьями
                       "length_of_working_part": 1000,  # длина режущей части протяжки
                       },
        }
HARD_ALLOYS = {"Т5К12В": 0, "Т5К10": 1, "Т14К8": 2, "Т15К6":  3, "Т30К4": 4, "ВК3": 5, "ВК4": 6, "ВК6": 7, "ВК8": 8}
HIGH_SPEED_STEELS = {"Р18": 9, "Р6М5": 10, "9ХС": 11, "ХГВ": 12, "У12А": 13}
# Словарь индексов материалов режущей части
MATERIALS_OF_CUTTING_PART = HARD_ALLOYS | HIGH_SPEED_STEELS
# Словарь наименований группы инструмента
GROUPS_TOOL = {"Инструмент": 0,
               "Резец": "turning",
               "Фреза": "milling",
               "Сверло": "drilling",
               "Зенкер": "countersinking",
               "Развертка": "deployment",
               "Протяжка": "broaching",
               }
# Типы стандартов инструмента
TYPES_STANDARD = ["ГОСТ", "ОСТ", "DIN", "ИСО"]

# Типы фрез:
TYPES_OF_MILLING_CUTTER = {"Цилиндрическая": 0,
                           "Торцовая": 1,
                           "Дисковая, обработка торца": 2,
                           "Дисковая, обработка паза": 3,
                           "Пазовая": 3,
                           "Отрезная": 4,
                           "Прорезная": 4,
                           "Концевая, обработка торца": 5,
                           "Концевая, обработка паза": 6,
                           "Угловая": 7,
                           "Фасонная, с выпуклым профилем": 8,
                           "Фасонная, с вогнутым профилем": 9,
                           "Шпоночная": 10,
                           "Резьбовая": 8,
                           "Червячная": 0,
                           }
# Типы режущей части фрезы:
TYPES_OF_CUTTING_PART_OF_MILLING_CUTTER = {"Винтовые пластинки": 0, "Цельная": 1, "Коронка": 2}
# Типы частоты шага:
TYPES_OF_LARGE_TOOTH = {"Крупный шаг": 0, "Мелкий шаг": 1}
# Типы частоты шага:
TYPES_OF_TOOL_HOLDER = {"В резцедержателе": 0, "В револьверной головке": 1}
# Типы нагрузок на резец
TYPES_OF_LOADS = {"Равномерная": 0, "Неравномерная": 1, "Неравномерная с большой неравномерностью": 2}
# =====================================================================================================================
# Квалитеты точности обработки
ACCURACY_STANDARDS = {0: "01", 1: "0", 2: "1", 3: "2", 4: "3", 5: "4", 6: "5", 7: "6", 8: "7", 9: "8", 10: "9",
                      11: "10", 12: "11", 13: "12", 14: "13", 15: "14", 16: "15", 17: "16", 18: "17"}
# Поля допусков
TOLERANCE_FIELDS = {0: 'A', 1: 'B', 2: 'C', 3: 'CD', 4: 'D', 5: 'E', 6: 'EF', 7: 'F', 8: 'FG', 9: 'G', 10: 'H',
                    11: 'JS', 12: 'J', 13: 'K', 14: 'M', 15: 'N', 16: 'P', 17: 'R', 18: 'S', 19: 'T', 20: 'U', 21: 'V',
                    22: 'X', 23: 'Y', 24: 'Z', 25: 'ZA', 26: 'ZB', 27: 'ZC', 28: 'a', 29: 'b', 30: 'c', 31: 'cd',
                    32: 'd', 33: 'e', 34: 'ef', 35: 'f', 36: 'fg', 37: 'g', 38: 'h', 39: 'js', 40: 'j', 41: 'k',
                    42: 'm', 43: 'n', 44: 'p', 45: 'r', 46: 's', 47: 't', 48: 'u', 49: 'v', 50: 'x', 51: 'y', 52: 'z',
                    53: 'za', 54: 'zb', 55: 'zc'}
# Классы точности инструмента
ACCURACY_CLASS_STANDARDS = {None: 0, "AAA": 1, "AA": 2, "A": 3, "B": 4, "C": 5, "D": 6, "ААА": 7, "АА": 8, "А": 9, "В": 10, "С": 11, "Д": 12,  }
# =====================================================================================================================
# Описание переменных классов
DECODING = {"type_cutter": "Тип инструмента: {obj}.",
            "angle_of_inclination": "Угол наклона зубьев протяжки: {obj} град.""",
            "pitch_of_teeth": "Шаг зубьев протяжки: {obj} мм.",
            "number_teeth_section": "Число зубьев секции протяжки: {obj}.",
            "difference": "Подача на зуб протяжки: {obj} мм/зуб",
            "length_of_working_part": "Длина режущей части протяжки: {obj} мм",
            "name": "Обозначение инструмента: {obj}",

            # может стоит выводить по отдельности
            # "dia_mm": "Диаметр инструмента = {obj} мм.",
            # "height_mm": "Высота инструмента = {obj} мм.",
            # "width_mm": "Ширина инструмента = {obj} мм.",
            # "length_mm": "Длина инструмента = {obj} мм.",
            "gabarit_str": "Размеры инструмента = {obj}",

            "num_of_cutting_blades": "Количество режущих лезвий инструмента: {obj} шт.",
            "type_of_mat": "Тип материала инструмента: {obj}.",
            "mat_of_cutting_part": "Материал режущей части инструмента: {obj}.",
            "type_of_cutting_part": "Вид режущей части инструмента: {obj}.",
            "additional_blade": "Наличие дополнительного лезвия: {obj}.",
            "large_tooth": "Крупный/мелкий зуб: {obj}.",
            "deep_or_complex_profile": "Показатель наличия глубокого или сложного профиля: {obj}.",
            "quantity": "Количество одновременно работающих инструментов: {obj}.",
            "turret": "Инструмент установлен в револьверную головку: {obj}.",
            "load": "Нагрузка на инструмент: {obj}.",
            "main_angle_grad": "Главный угол в плане: {obj} град.",
            "front_angle_grad": "Передний угол в плане: {obj} град.",
            "inclination_of_main_blade": "Угол наклона переднего лезвия: {obj} град.",
            "radius_of_cutting_vertex": "Радиус режущей вершины инструмента: {obj} град.",
            "blade_length": "Длина лезвия инструмента: {obj} град.",
            }
